{
   "Computer e dispositivi": {
      "ICT": {
         "Definire il termine Tecnologie dell'Informazione e della Comunicazione (Information and Communication Technology - ICT)":
            "Ogni giorno, utilizzando smartphone, computer, tablet o altri dispositivi elettronici effettuiamo azioni rese possibili dall'informatica. Anche numerose altre azioni che compiamo senza utilizzare personalmente dispositivi elettronici sono consentite dall'informatica: ad esempio quando alla cassa del supermercato i codici a barre dei prodotti che abbiamo acquistato comunicano alla cassiera il tipo di prodotto, il suo prezzo ed eventuali promozioni; quando chiediamo un certificato al Comune, a Scuola o a un altro Ente; quando paghiamo un prodotto con la carta di credito; quando ritiriamo banconote a uno sportello Bancomat; quando prenotiamo viaggi in treno o in aereo, e in migliaia di altri casi. Tutte queste azioni fanno parte delle Tecnologie della Comunicazione e dell'Informazione, la cosiddetta ICT (da “Information and Communication Technology”, che è la scienza che utilizza il computer, altri dispositivi elettronici e le tecnologie a essi collegati per archiviare, elaborare e trasmettere delle informazioni.",
         "Identificare diversi tipi di servizi e di utilizzi dell'ICT, quali servizi Internet, tecnologie mobili, applicazioni di produttività di ufficio":
            "I servizi e gli utilizzi dell'ICT sono numerosissimi. Tra essi ricordiamo innanzitutto quelli basati su Internet: l il commercio elettronico, in inglese e-commerce (la “e” iniziale del termine costituisce - in questo e nei casi successivi - l'abbreviazione della parola “electronic”), che consiste nella compravendita di beni e servizi tramite Internet, con possibilità di acquistare pressoché ogni tipo di prodotto o servizio (ad es. assicurazioni); l l'e-banking, che consente ai clienti di una banca di effettuare numerose operazioni tramite Internet, senza doversi recare in filiale; l l'e-government, che consiste nei servizi che la pubblica amministrazione offre ai cittadini attraverso Internet: come la richiesta di certificati o l'invio della dichiarazione dei redditi; l l'e-learning, termine che indica le tecniche di apprendimento basate sull'utilizzo degli strumenti elettronici e di Internet. Le nuove tecnologie danno più spazio alla creatività e all'interattività degli studenti, che possono accedere a materiale utile per i propri studi e comprendere meglio alcune discipline attraverso simulazioni multimediali; l il lavoro a domicilio, o smart working o telelavoro, che riguarda tutte le occupazioni nelle quali il prodotto può essere inviato in forma digitale e offre la possibilità di lavorare da casa in situazioni che limitano o impediscono la mobilità: emergenze sanitarie o metereologiche, persone affette da handicap motori oppure che hanno bambini piccoli o persone anziane o malate da accudire, ecc. Negli ultimi anni, la diffusione di smartphone e tablet, la digitalizzazione delle linee telefoniche e l'utilizzo di sistemi di trasmissione dei dati senza fili sempre più veloci, hanno permesso di usufruire di servizi e utilizzi ICT basati su tecnologie mobili con risultati paragonabili all'utilizzo dei computer fissi. Dovunque ci si trovi - in strada, in auto, in treno - è possibile navigare su Internet, controllare la propria posta elettronica e i messaggi digitali in genere, utilizzare sistemi di geolocalizzazione e così via. Infine, vanno ricordate le applicazioni di produttività di ufficio legate all'ICT, che consentono la creazione, l'archiviazione e lo scambio di documenti, la gestione della posta, delle attività e del calendario."
      },
      "Hardware": {
         "Definire il termine hardware. Identificare i principali tipi di computer, quali desktop, laptop (portatile), tablet. Identificare i principali tipi di dispositivi, quali smartphone, lettori multimediali, fotocamere digitali":
            "Il termine hardware indica le parti fisiche - vale a dire elettriche, elettroniche e meccaniche - del computer e dei dispositivi elettronici in genere: circuiti elettronici, tastiera, schermo, ecc. A volte, il termine hardware indica anche altri dispostivi collegati al computer: stampante, scanner, ecc. I computer adoperati in case, scuole, uffici e piccole aziende vengono detti personal computer o, in forma abbreviata, PC. Ne esistono di diversi tipi: l sino a qualche anno fa i più utilizzati sono stati i computer fissi o desktop computer, costituiti dal case che è il “contenitore” nel quale si trovano i componenti elettronici che costituiscono il vero e proprio computer, al quale sono collegati monitor, tastiera, mouse, casse acustiche, ecc.; l successivamente si sono diffusi i laptop computer, più noti come computer portatili o notebook, co- stituiti da un unico apparecchio in cui si trovano tutte le componenti elettroniche, la tastiera e lo schermo del computer; pesano in genere tra uno e due chili e hanno prestazioni simili a quelle dei computer fissi; l ancora più leggeri e trasportabili sono i tablet, che permettono di utilizzare applicazioni e digitare toc- cando direttamente sullo schermo, che è sensibile al tocco del dito ed è perciò detto touchscreen. Gli smartphone sono, invece, telefoni cellulari che permettono di collegarsi a Internet e di eseguire numerose applicazioni attraverso l'uso dello schermo touch. I lettori multimediali sono apparecchi elettronici in grado di conservare e riprodurre un grande numero di brani musicali e spesso anche foto e video; con dimensioni e peso estremamente ridotti. Altro dispositivo di utilizzo comune è la macchina fotografica digitale, che acquisisce e memorizza le immagini in una scheda di memoria, in modo da poterle poi archiviare, modificare, condividere tramite Internet, ecc."
      }
   }
}